espressif/binutils-esp32ulp/gas/config/tc-esp32ulp.c
/* tc-esp32ulp.c    
ESP32ULP GNU Assembler

Copyright (c) 2016-2017 Espressif Systems (Shanghai) PTE LTD.
   
based on Copyright (C) 2005-2017 Free Software Foundation, Inc.

This file is part of GAS, the GNU Assembler.

GAS is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation; either version 3, or (at your option)
any later version.

GAS is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with GAS; see the file COPYING.  If not, write to the Free
Software Foundation, 51 Franklin Street - Fifth Floor, Boston, MA
02110-1301, USA.  */

#include "as.h"
#include "struc-symbol.h"
#include "esp32ulp-defs.h"
#include "obstack.h"
#include "safe-ctype.h"
#ifdef OBJ_ELF
#include "dwarf2dbg.h"
#endif
#include "elf/common.h"
#include "elf/esp32ulp.h"

extern int yyparse(void);
struct yy_buffer_state;
typedef struct yy_buffer_state *YY_BUFFER_STATE;
extern YY_BUFFER_STATE yy_scan_string(const char *yy_str);
extern void yy_delete_buffer(YY_BUFFER_STATE b);
static parse_state parse(char *line);

/* Global variables. */
struct esp32ulp_insn *insn;
int last_insn_size;

extern struct obstack mempool;
FILE *errorf;

/* Flags to set in the elf header */
#define DEFAULT_FLAGS 0

#ifdef OBJ_FDPIC_ELF
# define DEFAULT_FDPIC EF_ESP32ULP_FDPIC
#else
# define DEFAULT_FDPIC 0
#endif

static flagword esp32ulp_flags = DEFAULT_FLAGS | DEFAULT_FDPIC;

static void
esp32ulp_s_bss(int ignore ATTRIBUTE_UNUSED)
{
	int temp;

	temp = get_absolute_expression();
	subseg_set(bss_section, (subsegT)temp);
	demand_empty_rest_of_line();
}

const pseudo_typeS md_pseudo_table[] = {
	{ "align", s_align_bytes, 0 },
	{ "byte2", cons, 2 },
	{ "byte4", cons, 4 },
	{ "db", cons, 1 },
	{ "dd", cons, 4 },
	{ "dw", cons, 2 },
	{ "p", s_ignore, 0 },
	{ "pdata", s_ignore, 0 },
	{ "var", s_ignore, 0 },
	{ "bss", esp32ulp_s_bss, 0 },
	{ 0, 0, 0 }
};

/* Characters that are used to denote comments and line separators. */
const char comment_chars[] = "#";
const char line_comment_chars[] = "#";
const char line_separator_chars[] = ";";

/* Characters that can be used to separate the mantissa from the
exponent in floating point numbers. */
const char EXP_CHARS[] = "eE";

/* Characters that mean this number is a floating point constant.
As in 0f12.456 or  0d1.2345e12.  */
const char FLT_CHARS[] = "fFdDxX";
unsigned int esp32ulp_anomaly_checks = 0;


/* Define esp32ulp-specific command-line options (there are none). */
const char *md_shortopts = "";

struct option md_longopts[] =
{
	{ NULL, no_argument, NULL, 0 },
};

size_t md_longopts_size = sizeof(md_longopts);


int
md_parse_option(int c ATTRIBUTE_UNUSED, const char *arg ATTRIBUTE_UNUSED)
{
	switch (c)
	{
	default:
		return 0;
	}

	return 1;
}

void
md_show_usage(FILE * stream)
{
	fprintf(stream, _(" ESP32 ULP processor has no specific assembler options:\n"));
}

/* Perform machine-specific initializations.  */
void
md_begin(void)
{
	/* Set the ELF flags if desired. */
	if (esp32ulp_flags)
		bfd_set_private_flags(stdoutput, esp32ulp_flags);

	/* Set the default machine type. */
	if (!bfd_set_arch_mach(stdoutput, bfd_arch_esp32ulp, 0))
		as_warn(_("Could not set architecture and machine."));

	/* Ensure that lines can begin with '(', for multiple
	register stack pops. */
	lex_type['('] = LEX_BEGIN_NAME;

#ifdef OBJ_ELF
	record_alignment(text_section, 2);
	record_alignment(data_section, 2);
	record_alignment(bss_section, 2);
#endif

	errorf = stderr;
	obstack_init(&mempool);

#ifdef DEBUG
	extern int debug_codeselection;
	debug_codeselection = 1;
#endif

	last_insn_size = 0;
}

/* Perform the main parsing, and assembly of the input here.  Also,
call the required routines for alignment and fixups here.
This is called for every line that contains real assembly code.  */
//#include "../../gdb/symtab.h"
void
md_assemble(char *line)
{
	char *toP = 0;
	int size, insn_size;
	struct esp32ulp_insn *tmp_insn;
	size_t len;
	static size_t buffer_len = 0;
	static char *current_inputline;
	parse_state state;

	len = strlen(line);
	if (len + 2 > buffer_len)
	{
		buffer_len = len + 40;
		current_inputline = XRESIZEVEC(char, current_inputline, buffer_len);
	}
	memcpy(current_inputline, line, len);
	current_inputline[len] = ';';
	current_inputline[len + 1] = '\0';

	//if (insn) //DEBUG_TRACE("dya_pass 222 insn old =%08x\n", (unsigned int)insn->value);
	state = parse(current_inputline);
	//if (insn) //DEBUG_TRACE("dya_pass 222 insn new =%08x\n", (unsigned int)insn->value);
	if (state == NO_INSN_GENERATED)
		return;

	for (insn_size = 0, tmp_insn = insn; tmp_insn; tmp_insn = tmp_insn->next)
		if (!tmp_insn->reloc || !tmp_insn->exp->symbol)
			insn_size += 2;
	// TODO:DYA insn_size - must be 4 in any case
	insn_size = 4;
	if (insn_size)
		toP = frag_more(insn_size);

	last_insn_size = insn_size;

#ifdef DEBUG
	printf("INS: %s\n", line);
#endif
	while (insn)
	{
		if (insn->reloc && insn->exp->symbol)
		{
			size = 4;
			//DEBUG_TRACE("insn->reloc && insn->exp->symbol BFD_ARELOC_ESP32ULP_PUSH size =%i, insn->exp->value=%i, insn->pcrel=%i, insn->reloc=%i\n", size, (unsigned int)insn->exp->value, insn->pcrel, insn->reloc);

			//char *prev_toP = toP - 2;
			//fix_new(frag_now, (prev_toP - frag_now->fr_literal), size, insn->exp->symbol, insn->exp->value, insn->pcrel, insn->reloc);
			// were - shift from current word... 
			fix_new(frag_now, 0, size, insn->exp->symbol, insn->exp->value, insn->pcrel, insn->reloc);
		}
		else
		{
			//DEBUG_TRACE("md_number_to_chars insn->value =%08x\n", (unsigned int)insn->value);
			//md_number_to_chars(toP, insn->value, 2);
			//toP += 2;
			// TODO:DYA - this is main changes for 32 bit words!!!!! changes stop work
			md_number_to_chars(toP, insn->value, 4);
			toP += 4;
		}
		size = 4;
#ifdef DEBUG
		//DEBUG_TRACE(" reloc : value = %08x, pc=%08x, reloc=%08x BFD_RELOC_ESP32ULP_PLTPC = %08x\n", (unsigned int)insn->value, (unsigned int)insn->pcrel, (unsigned int)insn->reloc, BFD_RELOC_ESP32ULP_PLTPC);
		if (insn->exp != ((void*)(0)))
		{
			//DEBUG_TRACE(" exp: %08x, sy_obj=%i\n", insn->exp->value, insn->exp->symbol->sy_obj.local);
		}
#endif
		insn = insn->next;
	}
#ifdef OBJ_ELF
	dwarf2_emit_insn(insn_size);
	//DEBUG_TRACE("dya_pass ============== >insn_size=%i\n", (unsigned int)insn_size);
#endif

	while (*line++ != '\0')
		if (*line == '\n')
			bump_line_counters();
}

/* Parse one line of instructions, and generate opcode for it.
To parse the line, YACC and LEX are used, because the instruction set
syntax doesn't confirm to the AT&T assembly syntax.
To call a YACC & LEX generated parser, we must provide the input via
a FILE stream, otherwise stdin is used by default.  Below the input
to the function will be put into a temporary file, then the generated
parser uses the temporary file for parsing.  */

