espressif/binutils-esp32ulp/gas/config/tc-esp32ulp.c
static parse_state
parse(char *line)
{
	parse_state state;
	YY_BUFFER_STATE buffstate;

	buffstate = yy_scan_string(line);

	/* our lex requires setting the start state to keyword
	every line as the first word may be a keyword.
	Fixes a bug where we could not have keywords as labels.  */
	set_start_state();

	/* Call yyparse here.  */
	//DEBUG_TRACE("yyparse: %s\n", line);
	state = yyparse();
	//DEBUG_TRACE("yyparse result!: %i\n", (int)state);
	if (state == SEMANTIC_ERROR)
	{
		as_bad(_("Parse failed."));
		//DEBUG_TRACE("yyparse ERROR!: %s\n", line);
		insn = 0;
	}

	yy_delete_buffer(buffstate);
	return state;
}

/* We need to handle various expressions properly.
Such as, [SP--] = 34, concerned by md_assemble().  */

void
md_operand(expressionS * expressionP)
{
	if (*input_line_pointer == '[')
	{
		as_tsktsk("We found a '['!");
		input_line_pointer++;
		expression(expressionP);
	}
}

/* Handle undefined symbols. */
symbolS *
md_undefined_symbol(char *name ATTRIBUTE_UNUSED)
{
	return (symbolS *)0;
}

int
md_estimate_size_before_relax(fragS * fragP ATTRIBUTE_UNUSED,
segT segment ATTRIBUTE_UNUSED)
{
	return 0;
}


void
md_apply_fix(fixS *fixP, valueT *valueP, segT seg ATTRIBUTE_UNUSED)
{
	char *where = fixP->fx_frag->fr_literal + fixP->fx_where;

	long value = *valueP;
	//DEBUG_TRACE("dya_pass - md_apply_fix: fixP->fx_r_type=%i, value=%i, fixP->fx_where=%i\n", fixP->fx_r_type, (unsigned int)value, (int)fixP->fx_where);
	switch (fixP->fx_r_type)
	{
	case BFD_RELOC_ESP32ULP_16_IMM:
		if (fixP->fx_addsy != NULL)// relocation will be done not in linker
		{
			asymbol *sym = symbol_get_bfdsym(fixP->fx_addsy);
			int force_reloc = S_FORCE_RELOC(fixP->fx_addsy, 1);
			//printf("force_reloc = %i \n", force_reloc);
			if (force_reloc != 0) if (sym->section->flags != 0) value = value >> 2;
		}
		if ((value < 0) || (value > 2047))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_16"));

		//value = value << 2;
		md_number_to_chars(where, value, 2);
		break;

	case BFD_RELOC_ESP32ULP_JUMPR:
		if (value < -0x8000 || value > 0x7fff)
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32ULP_JUMPR"));
		//value = value << 2;
		if (fixP->fx_addsy != NULL)// relocation will be done not in linker
		{
			asymbol *sym = symbol_get_bfdsym(fixP->fx_addsy);
			int force_reloc = S_FORCE_RELOC(fixP->fx_addsy, 1);
			if (force_reloc != 0) if (sym->section->flags != 0) value = value >> 2;
		}
		unsigned int temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~(0xff << 17);
		temp_val |= value;
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_JUMPR temp_val=%08x where[0]=%02x, where[1]=%02x, where[2]=%02x, where[3]=%02x, \n", (unsigned int)temp_val, (unsigned int)where[0], (int)where[1], (int)where[2], (int)where[3]);
		//md_number_to_chars(where, value, 0);
		break;
	case BFD_RELOC_ESP32ULP_16_LOAD:
		if (value > 0xffff)
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_LOAD_16"));
		//value = value << 2;
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~(0xffff);
		temp_val |= value;
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_16_LOAD temp_val=%08x where[0]=%02x, where[1]=%02x, where[2]=%02x, where[3]=%02x, \n", (unsigned int)temp_val, (unsigned int)where[0], (int)where[1], (int)where[2], (int)where[3]);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_WR_MEM:
		value = value >> 2;
		if ((value > 2047) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_WR_MEM"));
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x7ff << 10));
		temp_val |= (value << 10);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_WR_MEM temp_val=%08x where[0]=%02x, where[1]=%02x, where[2]=%02x, where[3]=%02x, \n", (unsigned int)temp_val, (unsigned int)where[0], (int)where[1], (int)where[2], (int)where[3]);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_ALUI:
		if ((value > 0x7fff) || (value < -0x7fff))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_ALUI"));
		//value = 0x00ffff; // for tests only
		if (fixP->fx_addsy != NULL)// relocation will be done not in linker
		{
			asymbol *sym = symbol_get_bfdsym(fixP->fx_addsy);
			if (sym->section->flags != 0) value = value >> 2;
		}
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xffff << 4));
		temp_val |= (value << 4);
		memcpy(where, &temp_val, 4);
		
		//if (fixP->fx_addsy != NULL)
		//{
		//	asymbol *sym = symbol_get_bfdsym(fixP->fx_addsy);
		//	DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_ALUI temp_val=%08x value=%08x, flags=%08x, fixP=%08x, done=%08x, fixP->fx_addsy=%08x, flags=%08x, name=%s\n",
		//		(unsigned int)temp_val, 
		//		(unsigned int)value, (unsigned int)seg->flags, *(unsigned int*)fixP, (unsigned int)fixP->fx_done, *(unsigned int*)fixP->fx_addsy, sym->section->flags, sym->section->name);
		//}
		//else
		//{
		//	DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_ALUI temp_val=%08x value=%08x, flags=%08x, fixP=%08x, done=%08x, fixP->fx_addsy=%08x\n", (unsigned int)temp_val, (unsigned int)value, (unsigned int)seg->flags, *(unsigned int*)fixP, (unsigned int)fixP->fx_done, 0xdead);
		//}
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_WAIT:
		if ((value > 0xffff) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_WAIT"));
		//value = value << 2;
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xffff << 0));
		temp_val |= (value << 0);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_WAIT temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_TSENS_CYCLE:
		if ((value > 0xfff) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_TSENS_CYLE"));
		//value = value << 2;
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xfff << 16));
		temp_val |= (value << 16);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_TSENS_CYCLE temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_TSENS_DELAY:
		if ((value > 0x3fff) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_TSENS_DELAY"));
		//value = value << 2;
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x3fff << 2));
		temp_val |= (value << 2);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_TSENS_DELAY temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_WAKE:
		if ((value > 1) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_WAKE"));
		//value = value << 2;
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x1 << 0));
		temp_val |= (value << 0);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_WAKE temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_SLEEP:
		if ((value > 4) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_SLEEP"));
		//value = value << 2;
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x0f << 0));
		temp_val |= (value << 0);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_SLEEP temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_ADC_CYCLE:
		if ((value > 0xffff) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_ADC_CYCLE"));
		//value = value << 2;
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xffff << 8));
		temp_val |= (value << 8);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_ADC_CYCLE temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_ADC_SEL:
		if ((value > 0x01) || (value < 0x00))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_ADC_SEL"));
		//value = value << 2;
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x1 << 6));
		temp_val |= (value << 6);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_ADC_SEL temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_ADC_MUX:
		if ((value > 0x0f) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_ADC_MUX"));
		//value = value << 2;
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x0f << 2));
		temp_val |= (value << 2);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_ADC_MUX temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_STAGE:
		if (value > 0xff)
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_STAGE"));
		//value = value << 2;
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xff << 4));
		temp_val |= (value << 4);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_STAGE temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_JUMPR_STEP:
		if ((value > 0x1FF) || (value < -0x1ff))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_JUMPR_STEP"));
		//value = value << 2;
		if (fixP->fx_addsy != NULL)// relocation will be done not in linker
		{
			asymbol *sym = symbol_get_bfdsym(fixP->fx_addsy);
			if (sym->section->flags != 0) value = value >> 2;
		}
		temp_val = 0;
		memcpy(&temp_val, where, 4);
		temp_val &= ~(0xff << 17);
		//if (value >= 0)
		//{
		//	temp_val |= (value & 0x7f) << 17;
		//}
		//else
		//{
		//	value = -value;
		//	temp_val |= (value & 0x7f) << 17;
		//	temp_val |= 0x80 << 17;
		//}
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_JUMPR_STEP value = %08x, temp_val=%08x where[0]=%02x, where[1]=%02x, where[2]=%02x, where[3]=%02x, fixP->fx_where = %i\n", 
		//	(unsigned int)value, (unsigned int)temp_val, (unsigned int)where[0], (int)where[1], (int)where[2], (int)where[3], (int)fixP->fx_where);
		//md_number_to_chars(where, value, 0);
		break;
	case BFD_RELOC_ESP32ULP_JUMPR_THRESH:
		if ((value > 0x7fff) || (value < -0x7fff))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_JUMPR_THRESH"));
		//value = value << 2;
		temp_val = 0;
		value &= 0xffff;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xffff << 0));
		temp_val |= (value << 0);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_JUMPR_THRESH temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_JUMPS_THRESH:
		if ((value > 0x7f) || (value < -0x7f))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_JUMPS_THRESH"));
		//value = value << 2;
		temp_val = 0;
		value &= 0xff;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xff << 0));
		temp_val |= (value << 0);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_JUMPS_THRESH temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		//md_number_to_chars(where, value, 0);
		break;

	case BFD_RELOC_ESP32ULP_REG_RW_HIGH:
		if ((value > 0x1f) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32ULP_REG_RW_HIGH"));
		temp_val = 0;
		value &= 0x1f;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x1f << 23));
		temp_val |= (value << 23);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_REG_RW_HIGH temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;
	case BFD_RELOC_ESP32ULP_REG_RW_LOW:
		if ((value > 0x1f) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32ULP_REG_RW_LOW"));
		temp_val = 0;
		value &= 0x1f;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x1f << 18));
		temp_val |= (value << 18);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_REG_RW_LOW temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;

