espressif/binutils-esp32ulp/gas/config/tc-esp32ulp.c
	case BFD_RELOC_ESP32ULP_REG_RW_ADDR:
		if ((value >= 0x400) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32ULP_REG_RW_ADDR"));

		if (fixP->fx_addsy != NULL)// relocation will be done not in linker
		{
			asymbol *sym = symbol_get_bfdsym(fixP->fx_addsy);
			if (sym->section->flags != 0) value = value >> 2;
		}
		temp_val = 0;
		value &= 0x3ff;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x3ff << 0));
		temp_val |= (value << 0);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_REG_RW_ADDR temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;
	case BFD_RELOC_ESP32ULP_REG_RW_DATA:
		if ((value > 0xff) || (value < 0))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32ULP_REG_RW_DATA"));
		temp_val = 0;
		value &= 0xff;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xff << 10));
		temp_val |= (value << 10);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_REG_RW_DATA temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;

	case BFD_RELOC_ESP32ULP_I2C_RW_HIGH:
		if ((value > 0x7) || (value < -0x7))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32ULP_I2C_RW_HIGH"));
		temp_val = 0;
		value &= 0x7;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x7 << 19));
		temp_val |= (value << 19);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_I2C_RW_HIGH temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;
	case BFD_RELOC_ESP32ULP_I2C_RW_LOW:
		if ((value > 0x7) || (value < -0x7))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32ULP_I2C_RW_LOW"));
		temp_val = 0;
		value &= 0x7;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0x7 << 16));
		temp_val |= (value << 16);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_I2C_RW_LOW temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;
	case BFD_RELOC_ESP32ULP_I2C_RW_SEL:
		if ((value > 0xf) || (value < -0xf))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32ULP_I2C_RW_SEL"));
		temp_val = 0;
		value &= 0xf;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xf << 22));
		temp_val |= (value << 22);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_I2C_RW_SEL temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;
	case BFD_RELOC_ESP32ULP_I2C_RW_ADDR:
		if ((value > 0xff) || (value < -0xff))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32ULP_I2C_RW_ADDR"));
		temp_val = 0;
		value &= 0xff;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xff << 0));
		temp_val |= (value << 0);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_I2C_RW_ADDR temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;
	case BFD_RELOC_ESP32ULP_I2C_RW_DATA:
		if ((value > 0xff) || (value < -0xff))
			as_bad_where(fixP->fx_file, fixP->fx_line, _("rel too far BFD_RELOC_ESP32ULP_I2C_RW_DATA"));
		temp_val = 0;
		value &= 0xff;
		memcpy(&temp_val, where, 4);
		temp_val &= ~((0xff << 8));
		temp_val |= (value << 8);
		memcpy(where, &temp_val, 4);
		//DEBUG_TRACE("dya_pass - md_apply_fix:BFD_RELOC_ESP32ULP_I2C_RW_DATA temp_val=%08x value=%08x\n", (unsigned int)temp_val, (unsigned int)value);
		break;

	default:
		fprintf(stderr, "Relocation %d not handled in gas." " Contact support.\n", fixP->fx_r_type);
		return;
		//if ((BFD_ARELOC_ESP32ULP_PUSH > fixP->fx_r_type) || (BFD_ARELOC_ESP32ULP_COMP < fixP->fx_r_type))
		//{
		//	fprintf(stderr, "Relocation %d not handled in gas." " Contact support.\n", fixP->fx_r_type);
		//	return;
		//}
	}

	if (!fixP->fx_addsy)
		fixP->fx_done = TRUE;

}

/* Round up a section size to the appropriate boundary.  */
valueT
md_section_align(segT segment, valueT size)
{
	int boundary = bfd_get_section_alignment(stdoutput, segment);
	return ((size + (1 << boundary) - 1) & -(1 << boundary));
}


const char *
md_atof(int type, char * litP, int * sizeP)
{
	return ieee_md_atof(type, litP, sizeP, FALSE);
}


/* If while processing a fixup, a reloc really needs to be created
then it is done here.  */

arelent *
tc_gen_reloc(asection *seg ATTRIBUTE_UNUSED, fixS *fixp)
{
	arelent *reloc;

	reloc = XNEW(arelent);
	reloc->sym_ptr_ptr = XNEW(asymbol *);
	*reloc->sym_ptr_ptr = symbol_get_bfdsym(fixp->fx_addsy);
	reloc->address = fixp->fx_frag->fr_address + fixp->fx_where;
	
	//reloc->address = reloc->address / 4;

	reloc->addend = fixp->fx_offset;
	reloc->howto = bfd_reloc_type_lookup(stdoutput, fixp->fx_r_type);
	
	//DEBUG_TRACE("tc_gen_reloc - reloc->address =%08x, symvalue=%08x, seg->flags=%08x, name=%s\n", (unsigned int)reloc->address, (unsigned int)(*reloc->sym_ptr_ptr)->value, (unsigned int)seg->flags, (*reloc->sym_ptr_ptr)->name);

	if (reloc->howto == (reloc_howto_type *)NULL)
	{
		as_bad_where(fixp->fx_file, fixp->fx_line,
			/* xgettext:c-format.  */
			_("reloc %d not supported by object file format"),
			(int)fixp->fx_r_type);

		xfree(reloc);

		return NULL;
	}

	return reloc;
}

/*  The location from which a PC relative jump should be calculated,
given a PC relative reloc.  */

long
md_pcrel_from_section(fixS *fixP, segT sec)
{
	if (fixP->fx_addsy != (symbolS *)NULL
		&& (!S_IS_DEFINED(fixP->fx_addsy)
		|| S_GET_SEGMENT(fixP->fx_addsy) != sec))
	{
		/* The symbol is undefined (or is defined but not in this section).
		Let the linker figure it out.  */
		return 0;
	}
	return fixP->fx_frag->fr_address + fixP->fx_where;
}

/* Return true if the fix can be handled by GAS, false if it must
be passed through to the linker.  */

bfd_boolean
esp32ulp_fix_adjustable(fixS *fixP)
{
	switch (fixP->fx_r_type)
	{
		/* Adjust_reloc_syms doesn't know about the GOT.  */
	case BFD_RELOC_ESP32ULP_GOT:
	case BFD_RELOC_ESP32ULP_PLTPC:
		/* We need the symbol name for the VTABLE entries.  */
	case BFD_RELOC_VTABLE_INHERIT:
	case BFD_RELOC_VTABLE_ENTRY:
		return 0;

	default:
		return 1;
	}
}

