espressif/binutils-esp32ulp/gas/config/tc-esp32ulp.c
/* Special extra functions that help esp32ulp-parse.y perform its job.  */

struct obstack mempool;

INSTR_T
conscode(INSTR_T head, INSTR_T tail)
{
	if (!head)
		return tail;
	head->next = tail;
	return head;
}

INSTR_T
conctcode(INSTR_T head, INSTR_T tail)
{
	INSTR_T temp = (head);
	if (!head)
		return tail;
	while (temp->next)
		temp = temp->next;
	temp->next = tail;

	return head;
}

INSTR_T
note_reloc(INSTR_T code, Expr_Node * symbol, int reloc, int pcrel)
{
	/* Assert that the symbol is not an operator.  */
	gas_assert(symbol->type == Expr_Node_Reloc);

	return note_reloc1(code, symbol->value.s_value, reloc, pcrel);

}

INSTR_T
note_reloc1(INSTR_T code, const char *symbol, int reloc, int pcrel)
{
	code->reloc = reloc;
	code->exp = mkexpr(0, symbol_find_or_make(symbol));
	code->pcrel = pcrel;
	return code;
}

INSTR_T
note_reloc2(INSTR_T code, const char *symbol, int reloc, int value, int pcrel)
{
	code->reloc = reloc;
	code->exp = mkexpr(value, symbol_find_or_make(symbol));
	code->pcrel = pcrel;
	return code;
}

INSTR_T
gencode(unsigned long x)
{
	INSTR_T cell = XOBNEW(&mempool, struct esp32ulp_insn);
	memset(cell, 0, sizeof(struct esp32ulp_insn));
	cell->value = (x);
	return cell;
}

int reloc;
int ninsns;
int count_insns;

static void *
allocate(size_t n)
{
	return obstack_alloc(&mempool, n);
}

Expr_Node *
Expr_Node_Create(Expr_Node_Type type,
Expr_Node_Value value,
Expr_Node *Left_Child,
Expr_Node *Right_Child)
{


	Expr_Node *node = (Expr_Node *)allocate(sizeof(Expr_Node));
	node->type = type;
	node->value = value;
	node->Left_Child = Left_Child;
	node->Right_Child = Right_Child;
	return node;
}

static const char *con = ".__constant";
static const char *op = ".__operator";
static INSTR_T Expr_Node_Gen_Reloc_R(Expr_Node * head);
INSTR_T Expr_Node_Gen_Reloc(Expr_Node *head, int parent_reloc);

INSTR_T
Expr_Node_Gen_Reloc(Expr_Node * head, int parent_reloc)
{
	/* Top level reloction expression generator VDSP style.
	If the relocation is just by itself, generate one item
	else generate this convoluted expression.  */

	INSTR_T note = NULL_CODE;
	INSTR_T note1 = NULL_CODE;
	int pcrel = 1;  /* Is the parent reloc pcrelative?
					This calculation here and HOWTO should match.  */

	if (parent_reloc)
	{
		/*  If it's 32 bit quantity then 16bit code needs to be added.  */
		int value = 0;

		if (head->type == Expr_Node_Constant)
		{
			/* If note1 is not null code, we have to generate a right
			aligned value for the constant. Otherwise the reloc is
			a part of the basic command and the yacc file
			generates this.  */
			value = head->value.i_value;
		}
		switch (parent_reloc)
		{
			/*  Some relocations will need to allocate extra words.  */
		case BFD_RELOC_ESP32ULP_16_IMM:
		case BFD_RELOC_ESP32ULP_JUMPR:
		case BFD_RELOC_ESP32ULP_16_LOAD:
		case BFD_RELOC_ESP32ULP_WR_MEM:
		case BFD_RELOC_ESP32ULP_ALUI:
		case BFD_RELOC_ESP32ULP_WAIT:
		case BFD_RELOC_ESP32ULP_TSENS_DELAY:
		case BFD_RELOC_ESP32ULP_WAKE:
		case BFD_RELOC_ESP32ULP_SLEEP:
		case BFD_RELOC_ESP32ULP_ADC_CYCLE:
		case BFD_RELOC_ESP32ULP_ADC_SEL:
		case BFD_RELOC_ESP32ULP_ADC_MUX:
		case BFD_RELOC_ESP32ULP_STAGE:
		case BFD_RELOC_ESP32ULP_JUMPR_STEP:
		case BFD_RELOC_ESP32ULP_JUMPR_THRESH:
		case BFD_RELOC_ESP32ULP_JUMPS_THRESH:
		case BFD_RELOC_ESP32ULP_REG_RW_HIGH:
		case BFD_RELOC_ESP32ULP_REG_RW_LOW:
		case BFD_RELOC_ESP32ULP_REG_RW_ADDR:
		case BFD_RELOC_ESP32ULP_REG_RW_DATA:
			note1 = conscode(gencode(value), NULL_CODE);
			pcrel = 0;
			break;
		case BFD_RELOC_16:
		case BFD_RELOC_24:
		case BFD_RELOC_32:
			note1 = conscode(gencode(value), NULL_CODE);
			pcrel = 0;
			break;
		default:
			note1 = NULL_CODE;
		}
	}
	if (head->type == Expr_Node_Constant)
		note = note1;
	else if (head->type == Expr_Node_Reloc)
	{
		note = note_reloc1(gencode(0), head->value.s_value, parent_reloc, pcrel);
		if (note1 != NULL_CODE)
			note = conscode(note1, note);
	}
	else if (head->type == Expr_Node_Binop
		&& (head->value.op_value == Expr_Op_Type_Add
		|| head->value.op_value == Expr_Op_Type_Sub)
		&& head->Left_Child->type == Expr_Node_Reloc
		&& head->Right_Child->type == Expr_Node_Constant)
	{
		int val = head->Right_Child->value.i_value;
		if (head->value.op_value == Expr_Op_Type_Sub)
			val = -val;
		note = conscode(note_reloc2(gencode(0), head->Left_Child->value.s_value,
			parent_reloc, val, 0),
			NULL_CODE);
		if (note1 != NULL_CODE)
			note = conscode(note1, note);
	}
	else
	{
		/* Call the recursive function.  */
		note = note_reloc1(gencode(0), op, parent_reloc, pcrel);
		if (note1 != NULL_CODE)
			note = conscode(note1, note);
		note = conctcode(Expr_Node_Gen_Reloc_R(head), note);
	}
	return note;
}

static INSTR_T
Expr_Node_Gen_Reloc_R(Expr_Node * head)
{

	INSTR_T note = 0;
	INSTR_T note1 = 0;

	switch (head->type)
	{
	case Expr_Node_Constant:
		note = conscode(note_reloc2(gencode(0), con, BFD_ARELOC_ESP32ULP_CONST, head->value.i_value, 0), NULL_CODE);
		break;
	case Expr_Node_Reloc:
		note = conscode(note_reloc(gencode(0), head, BFD_ARELOC_ESP32ULP_PUSH, 0), NULL_CODE);
		break;
	case Expr_Node_Unop:
		note1 = conscode(Expr_Node_Gen_Reloc_R(head->Left_Child), NULL_CODE);
		switch (head->value.op_value)
		{
		case Expr_Op_Type_NEG:
			note = conctcode(note1, conscode(note_reloc1(gencode(0), op, BFD_ARELOC_ESP32ULP_NEG, 0), NULL_CODE));
			break;
		case Expr_Op_Type_COMP:
			note = conctcode(note1, conscode(note_reloc1(gencode(0), op, BFD_ARELOC_ESP32ULP_COMP, 0), NULL_CODE));
			break;
		default:
			fprintf(stderr, "%s:%d:Unknown operator found for arithmetic" " relocation", __FILE__, __LINE__);
		}
		break;
	default:
		fprintf(stderr, "%s:%d:Unknown node expression found during " "arithmetic relocation generation", __FILE__, __LINE__);
	}
	return note;
}

/* Blackfin opcode generation.  */

/* These functions are called by the generated parser
(from esp32ulp-parse.y), the register type classification
happens in esp32ulp-lex.l.  */

#include "esp32ulp-aux.h"
#include "opcode/esp32ulp.h"

#define INIT(t)  t c_code = init_##t
#define ASSIGN(x) c_code.opcode |= ((x & c_code.mask_##x)<<c_code.bits_##x)
#define ASSIGNF(x,f) c_code.opcode |= ((x & c_code.mask_##f)<<c_code.bits_##f)

