espressif/binutils-esp32ulp/gas/config/tc-esp32ulp.c
#define GEN_OPCODE32()  \
	conscode (gencode (HI (c_code.opcode)), \
	conscode (gencode (LO (c_code.opcode)), NULL_CODE))

#define GEN_OPCODE16()  \
	conscode (gencode (c_code.opcode), NULL_CODE)


/*  32 BIT INSTRUCTIONS.  */
#define GEN_OPCODE32_DYA(opcode)  \
	conscode (gencode (opcode), NULL_CODE)


INSTR_T
esp32ulp_gen_progctrl(int prgfunc, int poprnd)
{
	prgfunc = prgfunc;
	poprnd = poprnd;
	unsigned int local_op = OP_CMD_WAIT(0);

	return GEN_OPCODE32_DYA(local_op);
}


// =================   ESP32 ===========================================================

INSTR_T esp32ulp_gen_alu_ADDR(int dst, int src1, int src2)
{
	//DEBUG_TRACE("dya_pass - esp32ulp_gen_alu_add - dst=%i, src1=%i, src2=%i\n", dst, src1, src2);
	unsigned int local_op = I_ALUR(dst, src1, src2, ALU_SEL_ADD);
	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32ulp_gen_alu_r(int dst, int src1, int src2, int operation)
{
	//DEBUG_TRACE("dya_pass - esp32ulp_gen_alu_r - dst=%i, src1=%i, src2=%i, op = %i\n", dst, src1, src2, operation);
	unsigned int local_op = I_ALUR(dst, src1, src2, operation);
	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32ulp_gen_alu_i(int dst, int src1, Expr_Node* addr, int operation)
{
	//DEBUG_TRACE("dya_pass - esp32ulp_gen_alu_i - dst=%i, src1=%i, operation = %i, type=%i, op_value = %i\n", dst, src1, operation, (int)addr->type, (int)addr->value.op_value);
	int imm_val = EXPR_VALUE(addr);
	unsigned int local_op = I_ALUI(dst, src1, imm_val, operation);
	int rel = BFD_RELOC_ESP32ULP_ALUI;
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}


INSTR_T esp32ulp_gen_jump_r(int dst_reg, int cond)
{
	//DEBUG_TRACE("dya_pass - esp32ulp_gen_jump_r - dst_reg=%i, cond=%i\n", dst_reg, cond);
	unsigned int local_op = I_JUMP_RI(dst_reg, 0, cond, 0);
	return GEN_OPCODE32_DYA(local_op);
}
INSTR_T esp32ulp_gen_jump_i(Expr_Node* addr, int cond)
{
	int val;
	int rel = 0;

	rel = BFD_RELOC_ESP32ULP_16_IMM;

	val = EXPR_VALUE(addr);
	unsigned int local_op = I_JUMP_RI(0, val>>2, cond, 0);

	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}

INSTR_T esp32ulp_gen_jump_relr(Expr_Node* addr, int judge, int thresh)
{
	int rel = 0;

	rel = BFD_RELOC_ESP32ULP_JUMPR;

	int val = EXPR_VALUE(addr);
	unsigned int local_op = I_JUMP_RELR(thresh, judge, (unsigned int)val>>2);
	//DEBUG_TRACE("dya_pass - esp32ulp_gen_jump_relr thresh=%i, judge=%i, local_op=%x\n", (int)thresh, (int)judge, local_op);

	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}

INSTR_T esp32ulp_cmd_jump_relr(Expr_Node* step, Expr_Node* thresh, int cond)
{
	int step_val = EXPR_VALUE(step);
	int thresh_val = EXPR_VALUE(thresh);

	//DEBUG_TRACE("dya_pass - esp32ulp_cmd_jump_relr\n");
	unsigned int local_op = I_JUMP_RELR(thresh_val, cond, step_val>>2);
	return conscode(gencode(local_op), conctcode(Expr_Node_Gen_Reloc(step, BFD_RELOC_ESP32ULP_JUMPR_STEP), Expr_Node_Gen_Reloc(thresh, BFD_RELOC_ESP32ULP_JUMPR_THRESH)));
}
INSTR_T esp32ulp_cmd_jump_rels(Expr_Node* step, Expr_Node* thresh, int cond)
{
	int step_val = EXPR_VALUE(step);
	int thresh_val = EXPR_VALUE(thresh);

	//DEBUG_TRACE("dya_pass - esp32ulp_cmd_jump_rels\n");
	unsigned int local_op = I_JUMP_RELS(thresh_val, cond, step_val>>2);
	return conscode(gencode(local_op), conctcode(Expr_Node_Gen_Reloc(step, BFD_RELOC_ESP32ULP_JUMPR_STEP), Expr_Node_Gen_Reloc(thresh, BFD_RELOC_ESP32ULP_JUMPS_THRESH)));
}
INSTR_T esp32ulp_cmd_reg_rd(Expr_Node* addr, Expr_Node* high, Expr_Node* low)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_REG_RD \n");
	unsigned int addr_val = EXPR_VALUE(addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);

	unsigned int local_op = I_RD_REG(addr_val, low_val, high_val);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(addr, BFD_RELOC_ESP32ULP_REG_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32ULP_REG_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32ULP_REG_RW_LOW))));
}
INSTR_T esp32ulp_cmd_reg_wr(Expr_Node* addr, Expr_Node* high, Expr_Node* low, Expr_Node* data)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_REG_WR \n");
	unsigned int addr_val = EXPR_VALUE(addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);
	unsigned int data_val = EXPR_VALUE(data);

	unsigned int local_op = I_WR_REG(addr_val, low_val, high_val, data_val);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(addr, BFD_RELOC_ESP32ULP_REG_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(data, BFD_RELOC_ESP32ULP_REG_RW_DATA),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32ULP_REG_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32ULP_REG_RW_LOW)))));
}

INSTR_T esp32ulp_cmd_i2c_rd(Expr_Node* i2c_addr, Expr_Node* high, Expr_Node* low, Expr_Node* i2c_sel)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_I2C_RD \n");
	unsigned int addr_val = EXPR_VALUE(i2c_addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);
	unsigned int i2c_sel_val = EXPR_VALUE(i2c_sel);

	unsigned int local_op = I_I2C_RW(addr_val, 0, low_val, high_val, i2c_sel_val, OPCODE_I2C_RD);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(i2c_addr, BFD_RELOC_ESP32ULP_I2C_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(i2c_sel, BFD_RELOC_ESP32ULP_I2C_RW_SEL),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32ULP_I2C_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32ULP_I2C_RW_LOW)))));
}
INSTR_T esp32ulp_cmd_i2c_wr(Expr_Node* i2c_addr, Expr_Node* high, Expr_Node* low, Expr_Node* i2c_sel, Expr_Node* data)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_I2C_RD \n");
	unsigned int addr_val = EXPR_VALUE(i2c_addr);
	unsigned int high_val = EXPR_VALUE(high);
	unsigned int low_val = EXPR_VALUE(low);
	unsigned int i2c_sel_val = EXPR_VALUE(i2c_sel);
	unsigned int data_val = EXPR_VALUE(data);

	unsigned int local_op = I_I2C_RW(addr_val, data_val, low_val, high_val, i2c_sel_val, OPCODE_I2C_WR);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(i2c_addr, BFD_RELOC_ESP32ULP_I2C_RW_ADDR),
		conctcode(Expr_Node_Gen_Reloc(i2c_sel, BFD_RELOC_ESP32ULP_I2C_RW_SEL),
		conctcode(Expr_Node_Gen_Reloc(data, BFD_RELOC_ESP32ULP_I2C_RW_DATA),
		conctcode(Expr_Node_Gen_Reloc(high, BFD_RELOC_ESP32ULP_I2C_RW_HIGH), Expr_Node_Gen_Reloc(low, BFD_RELOC_ESP32ULP_I2C_RW_LOW))))));
}


INSTR_T esp32ulp_gen_jump_rels(Expr_Node* addr, int judge, int thresh)
{
	judge = judge;
	thresh = thresh;
	int rel = 0;

	rel = BFD_RELOC_ESP32ULP_JUMPR;
	unsigned int local_op = 0;// I_JUMP_RELR(0, val, cond, 1);

