espressif/binutils-esp32ulp/gas/config/tc-esp32ulp.c
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}

INSTR_T esp32ulp_wr_mem_addr(int dst_reg, int src_reg, Expr_Node* addr)
{
	//DEBUG_TRACE("dya_pass - esp32ulp_wr_mem_addr - dst_reg=%i, src_reg=%i, addr=%i\n", dst_reg, src_reg, (int)0);
	int addr_val = EXPR_VALUE(addr);
	unsigned int local_op = WR_MEM(dst_reg, src_reg, addr_val>>2);// I_JUMP_RELR(0, val, cond, 1);

	int rel = 0;
	rel = BFD_RELOC_ESP32ULP_WR_MEM;
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}

INSTR_T esp32ulp_wr_mem_offset(int dst_reg, int src_reg, int addr)
{
	//DEBUG_TRACE("dya_pass - esp32ulp_wr_mem_offset - dst_reg=%i, src_reg=%i, addr=%i\n", dst_reg, src_reg, addr);
	unsigned int local_op = WR_MEM(dst_reg, src_reg, addr);// I_JUMP_RELR(0, val, cond, 1);

	return GEN_OPCODE32_DYA(local_op);
}


INSTR_T esp32ulp_rd_mem_addr(int dst_reg, int src_reg, Expr_Node* addr)
{
	//DEBUG_TRACE("dya_pass - esp32ulp_rd_mem_addr - dst_reg=%i, src_reg=%i, addr=%i\n", dst_reg, src_reg, (int)0);
	int addr_val = EXPR_VALUE(addr);
	unsigned int local_op = RD_MEM(dst_reg, src_reg, addr_val>>2);// I_JUMP_RELR(0, val, cond, 1);

	int rel = 0;
	rel = BFD_RELOC_ESP32ULP_WR_MEM;
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(addr, rel));
}

INSTR_T esp32ulp_rd_mem_offset(int dst_reg, int src_reg, int addr)
{
	//DEBUG_TRACE("dya_pass - esp32ulp_rd_mem_offset - dst_reg=%i, src_reg=%i, addr=%i\n", dst_reg, src_reg, addr);
	unsigned int local_op = RD_MEM(dst_reg, src_reg, addr);// I_JUMP_RELR(0, val, cond, 1);

	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32ulp_cmd_halt()
{
	//DEBUG_TRACE("dya_pass - OP_CMD_HALT \n");
	unsigned int local_op = OP_CMD_HALT();

	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32ulp_cmd_sleep(Expr_Node*  cycles)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_SLEEP \n");
	int cycles_val = EXPR_VALUE(cycles);
	unsigned int local_op = OP_CMD_SLEEP(cycles_val);
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(cycles, BFD_RELOC_ESP32ULP_SLEEP));
}

INSTR_T esp32ulp_cmd_wakeup(Expr_Node*  wake)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_WAKEUP \n");
	int wake_val = EXPR_VALUE(wake);
	unsigned int local_op = OP_CMD_WAKEUP(wake_val);

	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(wake, BFD_RELOC_ESP32ULP_WAKE));
}

INSTR_T esp32ulp_cmd_stage(int dir, Expr_Node* imm)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_STAGE_INC \n");
	int imm_val = EXPR_VALUE(imm);
	unsigned int local_op = I_ALUS(dir, imm_val);

	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(imm, BFD_RELOC_ESP32ULP_STAGE));
}

INSTR_T esp32ulp_cmd_stage_rst()
{
	//DEBUG_TRACE("dya_pass - OP_CMD_STAGE_RST \n");
	unsigned int local_op = I_ALUS(ALU_SEL_SRST, 0);

	return GEN_OPCODE32_DYA(local_op);
}

INSTR_T esp32ulp_cmd_wait(Expr_Node* cycles)
{
	int cycles_val = EXPR_VALUE(cycles);
	unsigned int local_op = OP_CMD_WAIT(cycles_val);
	int rel = BFD_RELOC_ESP32ULP_WAIT;
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(cycles, rel));
}

INSTR_T esp32ulp_cmd_tsens(int dreg, Expr_Node* delay)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_TSENS \n");
	int delay_val = EXPR_VALUE(delay);
	unsigned int local_op = OP_CMD_TSENS(dreg, delay_val);
	return conscode(gencode(local_op), Expr_Node_Gen_Reloc(delay, BFD_RELOC_ESP32ULP_TSENS_DELAY));
}

INSTR_T esp32ulp_cmd_adc(int dreg, Expr_Node* sar_sel, Expr_Node* mux)
{
	//DEBUG_TRACE("dya_pass - OP_CMD_ADC \n");
	unsigned int sar_val = EXPR_VALUE(sar_sel);
	unsigned int mux_val = EXPR_VALUE(mux);
	unsigned int local_op = OP_CMD_ADC(dreg, mux_val, sar_val);

	return conscode(gencode(local_op),
		conctcode(Expr_Node_Gen_Reloc(mux, BFD_RELOC_ESP32ULP_ADC_MUX), Expr_Node_Gen_Reloc(sar_sel, BFD_RELOC_ESP32ULP_ADC_SEL)));
}


int
esp32ulp_force_relocation(struct fix *fixp)
{
	if (fixp->fx_r_type == BFD_RELOC_ESP32ULP_JUMPR)
		return TRUE;

	return generic_force_reloc(fixp);
}

//==================================    ESP     ==========================



bfd_boolean
esp32ulp_eol_in_insn(char *line)
{
	/* Allow a new-line to appear in the middle of a multi-issue instruction.  */

	char *temp = line;

	if (*line != '\n')
		return FALSE;

	/* A semi-colon followed by a newline is always the end of a line.  */
	if (line[-1] == ';')
		return FALSE;

	if (line[-1] == '|')
		return TRUE;

	/* If the || is on the next line, there might be leading whitespace.  */
	temp++;
	while (*temp == ' ' || *temp == '\t') temp++;

	if (*temp == '|')
		return TRUE;

	return FALSE;
}

bfd_boolean
esp32ulp_start_label(char *s)
{
	while (*s != 0)
	{
		if (*s == '(' || *s == '[')
			return FALSE;
		s++;
	}

	return TRUE;
}



